fadhil-abyan/low-level-cakrai17/lib/ESP32BoardV1Pin/ESP32BoardV1Pin.h

// Communication Interface Pins
#define ESP32_UART0_RX  44
#define ESP32_UART0_TX  43
#define ESP32_CAN_RX    18
#define ESP32_CAN_TX    17
#define ESP32_I2C_SDA   8
#define ESP32_I2C_SCL   9

// Motor Control Pins
#define ESP32_MTR0_EN   41
#define ESP32_MTR0_FWD  40
#define ESP32_MTR0_REV  39
#define ESP32_MTR1_EN   16
#define ESP32_MTR1_FWD  10
#define ESP32_MTR1_REV  11
#define ESP32_MTR2_EN   1
#define ESP32_MTR2_FWD  2
#define ESP32_MTR2_REV  42
#define ESP32_MTR3_EN   12
#define ESP32_MTR3_FWD  13
#define ESP32_MTR3_REV  14

// Encoder Pins
#define ESP32_ENC0_A    19
#define ESP32_ENC0_B    20
#define ESP32_ENC1_A    37
#define ESP32_ENC1_B    38
#define ESP32_ENC2_A    21
#define ESP32_ENC2_B    47
#define ESP32_ENC3_A    35
#define ESP32_ENC3_B    36

// PWM Pins
#define ESP32_PWM0      4
#define ESP32_PWM1      5
#define ESP32_PWM2      6
#define ESP32_PWM3      7
#define ESP32_PWM4      15
#define ESP32_PWM5      3

// Digital Pneumatic Pins
#define ESP32_PNEU0     12
#define ESP32_PNEU1     2
#define ESP32_PNEU2     14
#define ESP32_PNEU3     42
#define ESP32_PNEU4     13
#define ESP32_PNEU5     1

// Miscellaneous Pins
#define ESP32_BUILTIN_LED 48